  DEFINE PATH                                           -               
   (NAME(AWS.M2.CARDDEMO.CARDDATA.VSAM.AIX.PATH)        -               
    PATHENTRY(AWS.M2.CARDDEMO.CARDDATA.VSAM.AIX))                       
