 /*******************************************************************
  * Copyright Amazon,com, Inc, or its affiliates,                   *
  * All Rights Reserved,                                            *
  *                                                                 *
  * Licensed under the Apache License, Version 2,0 (the "License"), *
  * You may not use this file except in compliance with the License,*
  * You may obtain a copy of the License at                         *
  *                                                                 *
  *    http://www,apache,org/licenses/LICENSE_2,0                   *
  *                                                                 *
  * Unless required by applicable law or agreed to in writing,      *
  * software distributed under the License is distributed on an     *
  * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,    *
  * either express or implied, See the License for the specific     *
  * language governing permissions and limitations under the License*
  ******************************************************************/
 DCL 1 SEC_USER_DATA,
         2 SEC_USR_ID                 CHAR(8),
         2 SEC_USR_FNAME              CHAR(20),
         2 SEC_USR_LNAME              CHAR(20),
         2 SEC_USR_PWD                CHAR(8),
         2 SEC_USR_TYPE               CHAR(1),
         2 SEC_USR_FILLER             CHAR(23);
